[
  {
    "id": 1,
    "type": "Data Science",
    "title": "Using NLP to improve Investment Decisions",
    "description": "Fine-tuning FinBERT to Perform Sentiment Analysis on 10-K Filings",
    "body": ["Amid the growing adoption of Natural Language Processing (NLP) in financial analysis, models like FinBERT have gained prominence. Acknowledging the inherent volatility of stock market dynamics, this study seeks to enhance the foundational FinBERT architecture by incorporating supplementary features and developing a multilayered neural network ro perform sentiment analysis on 10-k filings. Specifically, 3 variations of the FinBERT model were employed which included - the baseline FinBERT model applied directly to the data, FinBERT integrated with optimization and loss functions, and a custom sentiment neural model that leverages FinBERT as the initial layer.",
    "The research objective was to surpass the baseline FinBERT model’s accuracy by a minimum of 10%. This goal was successfully achieved by the custom sentiment model. The analysis of misclassified filings revealed that while sentiment comprehension within these filings is achievable, translating it into precise market return predictions remains intricate and multifaceted."],
    "mainImage": "images/negative_cloud.png",
    "created": "Python using pyTorch, transformers, sklearn, numpy, and matplotlib",
    "media": "https://www.youtube.com/embed/bn9e_Pa9XPM",
    "gitLink": "https://github.com/pranathi-alluri/FinBERT_sentiment_analysis",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:e0b9974b-17d1-31ac-a79a-5eedf7bec09a"
  },
  {
    "id": 2,
    "type": "Data Science",
    "title": "Credit Card Fraud Detection",
    "description": "Applied a range of supervised and unsupervised machine learning techniques on over 1,000,000 generated credit card transactions to detect fraud",
    "body": ["With the increase of online transactions and ease of access to personal information, credit card fraud continues to be a challenge that costs billions of dollars annually. Millions of real-time transactions are made on a daily basis, making it difficult to distinguish between legitimate and fraudulent transactions quickly. Furthermore,  the methods used by fraudsters are ever developing, making it hard to pinpoint breaches. The vast amount of information, as well as the need to find patterns and make predictions, makes this not only a relevant, but an important data mining problem. Specifically, we hope to find the best machine learning model and associated hyperparameters to quickly and efficiently label credit card transactions as fraudulent or not.",
      "Credit card fraud detection is an interesting problem because it can be viewed as both a supervised machine learning problem, in which labeled data is used to predict the classification of new data, or an unsupervised machine learning problem where patterns and groups are identified. Hence, we will be using both supervised and unsupervised methods on our data, including Logistic Regression, SVM, decision trees, random forest, and K Mean clustering. We will be comparing the different models by running performance metrics and error analysis (ex. Accuracy, precision, recall, Roc-auc curve)  on each of the models, to find the best one for the data."],
    "mainImage": "images/credit.png",
    "created": "Python using sklearn, numpy, pandas, matplotlib, and seaborn",
    "myRole": ["Normalized, cleaned, and split the generated data",
    "Applied Haversine formula to generate transactions within a specific radius of customers",
    "Implemented SVM with hyperparameter tuning for generated transaction data "],
    "media": "https://www.youtube.com/embed/I2XTedxCEm4",
    "gitLink": "https://github.com/pranathi-alluri/CreditCardFraudDetection",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:9a80dd6a-4d73-36e9-9e23-e7d0d7568a6e"
  },
  {
    "id": 3,
    "type": "Data Science",
    "title": "Matchmaker, Matchmaker, Make Me a Match: Pharma Edition",
    "description": "Conducted Drug-Condition-Gene Associations Analysis on pharmaceutical data using Neo4j",
    "body": ["This exploratory drug-condition-gene investigation aims to identify key trends, commonalities, and possible underlying factors to the current drug offerings on the pharmaceutical market. By not only connecting drugs with their target conditions but connecting said conditions with genetic contributors, this study identifies potential underlying reasons behind patient favorability of certain drugs. Inversely, key trends and commonalities in drugs may lend insights into poor patient satisfaction for clusters of drugs and subsequent, connected conditions. This study and its findings serve as a market overview of the pharmaceutical industry, instructing further research into overlooked conditions and improved drug formulation. In an increasingly patient-centric healthcare system, pharmaceutical formulation must take into account patient experiences and perceptions of their treatment options."],
    "mainImage": "images/drug.png",
    "created": "Neo4j, python, SQL, and Excel",
    "myRole": ["Asking relevant business questions based on the data collected",
      "Converting the business questions into appropriate neo4j queries"],
    "images": ["images/drug-slide1.jpg", "images/drug-slide2.jpg"],
    "gitLink": "https://github.com/pranathi-alluri/DrugRecommendation",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:cff5c76d-a3dc-3a0c-8d6e-4f186c033916"
  },
  {
    "id": 4,
    "type": "Data Science",
    "title": "Parkinson’s disease detection",
    "description": "Machine-learning models of classification were applied to biomedical voice measurements data in an effort to detect for Parkinson's Disease",
    "body": ["Parkinson’s disease (PD) is the second most common neurodegenerative disease and affects ten million people around the world. With both motor and non-motor symptoms, Parkinson’s has a major impact on simple tasks, as well as the daily lives of many. Although there is currently no cure, treatments tend to be effective when patients are diagnosed early on. Thus, creating machine learning models running classification on various physiological measurements of people with and without PD, can help in detecting and predicting Parkinson’s disease early-on, hopefully improving the lives of patients. In this paper well-known supervised machine learning models for classification, including logistic regression, ridge classification, support vector machines (SVMs), decision tree, random forest, and feed forward neural network classification, are applied to biomedical voice measurements data of people with and without PD in an effort to choose the most effective hyper parameters for each model, as well as the best model in general. It was found that all models performed well, however SVMs had the highest accuracy overall."],
    "mainImage": "images/pd.png",
    "created": "Python using sklearn, pyTorch, numpy, pandas, matplotlib, and seaborn",
    "images": ["images/pd-graph.png"],
    "gitLink": "https://github.com/pranathi-alluri/ParkinsonDetection",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:f80d020c-4418-3a68-b3e0-64e5f2c2dc53"
  },
  {
    "id": 5,
    "type": "Data Science",
    "title": "Co-op'd",
    "description": "A visualization tool that dynamically illustrates co-ops done by students at Northeastern",
    "body": ["Internships are highly sought out by a majority of college students, but the process of finding companies that align with one’s values and interests is far from easy. This is especially true for Northeastern students, where co-ops and internships are integrated into the curriculum, and a defining part of being a husky.",
    "Hoping to make this process less stressful, we created the “CoOp’d” visualization tool using data collected through the accompanying Coop’d app, which is secure to Northeastern students and includes rating, salary, location, and drug information about various companies from past student experiences. Although the app worked well for finding general information, it was difficult to explore various options and filter based on your needs. Hence, we created an additional visualization tool to make exploring, filtering, and searching extremely simple."],
    "mainImage": "images/co-op'd.png",
    "created": "d3.js, HTML, CSS, and Excel",
    "myRole": ["Used user input to design appropriate graph types that displayed the data in an intuitive manner",
    "Coded the college graph along with all functionality",
    "Implemented brushing and linking between bar graphs and the main scatterplot",
    "Meeting and Documentation Coordinator"],
    "media": "https://www.youtube.com/embed/72KWWIcKNYI",
    "gitLink": "https://github.com/pranathi-alluri/Co-op-d-Visualization",
    "reportLink": "https://ds4200-s22.github.io/final-project-co-op-d/"
  },
  {
    "id": 6,
    "type": "Data Science",
    "title": "Hungry Huskies",
    "description": "A search and rating tool to help college students find places to eat near Campus",
    "body": ["As Northeastern students, finding a place to eat seems to be a never-ending challenge. This doesn’t need to be the case! Whether it be an affordable quick bite, a place to hang out with friends on Friday Nights, or a restaurant that accommodates your dietary restrictions, Hungry Huskies got you covered.",
    "Hungry Huskies was created to easily access restaurants within a 0.6-mile radius (walking distance) of the Boston Campus, along with information regarding their ratings, price range, social media, dietary restrictions, cuisine type, whether or not they accept dining dollars, and more. Having this information in one place makes it extremely easy to find a place to eat. On top of that, the tool allows members to create curated lists of restaurants, which can also be shared with other members, saving tons of time.",
    "Not happy with a restaurant’s service or just found your next dessert spot, let others know by leaving a review and comment on the restaurant’s page. Although there are various search and rating tools online, this is tailored to Northeastern students, making the whole experience more accessible and personal."],
    "mainImage": "images/2-bg-hungry.jpg",
    "created": "MySQL, Python, and Excel",
    "media": "https://www.youtube.com/embed/CGd40HieSEU",
    "images": ["images/hungry-design.png", "images/hungry-uml.png"],
    "gitLink": "https://github.com/pranathi-alluri/Hungry-Huskies",
    "reportLink": "https://docs.google.com/presentation/d/1GfnxePl3mxiRT1pIAFtBGzcOqV4-3UXDPic8saxlycY/edit?usp=sharing"
  },
  {
    "id": 7,
    "type": "Computer Science",
    "title": "AI to play Azul",
    "description": "Use various adversarial search algorithms to play the board game Azul",
    "body": ["Azul is a 2-4 player game in which you compete to collect tiles and place them adjacent to each other on the preset board in order to gain the most points. As in other common games, the environment for Azul is fully observable, as the tile choices and other players' boards are always present. Furthermore, actions within rounds are strategic, as the next state is completely determined by the current state and the actions executed by all players. This results in a multi-agent, adversarial problem, in which players are competing with each other. However, Azul is unique from other games, as the tiles drawn at the beginning of each round, and the associated factory tiles they are placed on are random, making this implementation unique and a good problem to answer. Thus, the main objective of this project was to study and report on the effectiveness of using various heuristics and AI algorithms to play Azul, against a random, naive, and human player."],
    "mainImage": "images/azul.jpg",
    "myRole": ["Implemented monte carlo tree search algorithm with various rollout policies to find the best one",
    "Enabled functionality for multiplayer games (up to 4 people) with AI"],
    "created": "Python",
    "gitLink": "https://github.com/pranathi-alluri/AzulAi",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:7644a144-e1d9-3fca-83db-be270cf1c226"
  },
  {
    "id": 8,
    "type": "Computer Science",
    "title": "Simple Animator",
    "description": "Application that creates simple 2D animations from shapes",
    "body": ["The simple animator was developed in Java using MVC architecture to create animations from shapes. To effectively accomplish this, our model uses lists of keyframes to represent the movement of each shape during the duration of the animation, done using linear interpolation. This results in O(number of shapes + number of motions) memory needed to store a movie, making it the most efficient design.",
    "Furthermore, working through the design process, thoroughly creating interfaces, abstract classes, and factory methods, prevented duplicate code and mutation while ensuring loose coupling between the model, view, and controller. This established a strong foundation that can be easily adapted in the future to accommodate more complex features. For example, currently, our animator only takes in rectangles and ellipses, but adding a new type of shape can be easily achieved by extending the SimpleShape class."],
    "mainImage": "images/3-bg-animator.png",
    "myRole": ["Coded the various views to represent and interact with the animation playing",
    "Ran thorough testing to ensure all instances of the animator worked as expected"],
    "created": "Java using Swing, GUI, JPanel, and JFrame",
    "media": "https://www.youtube.com/embed/kY80PmMUzDc",
    "gitLink": "https://github.com/pranathi-alluri/Animator"
  },
  {
    "id": 9,
    "type": "Other",
    "title": "Transcript profiling of Landoltia punctata",
    "description": "Sequenced and analyzed duckweed (Landoltia punctata) mRNA using molecular biology and bioinformatic techniques",
    "body": ["In order to analyze mRNA population of duckweed (Landoltia punctata) PCR, restriction digests, and gel electrophoresis were used, to isolate and sequence genes expressed in the organism. After finding the coding sequences,  the genes were analyzed by running BLAST comparisons of the nucleotide sequence and coded amino acid sequence. It was discovered that the mRNA sequence was similar to sequences that code for chaperone-like protein of POR1, which is required for chloroplast biogenesis and development. This research was done as part of the Waksman Student Scholars DNA Sequence Analysis Program and published to the NCBI sequence database."],
    "mainImage": "images/duckweed.jpg",
    "reportLink": "https://www.ncbi.nlm.nih.gov/nuccore/JZ983497.1?report=genbank&to=624"
  },
  {
    "id": 10,
    "type": "Other",
    "title": "Virtual reality to combat AD",
    "description": "Conducted literary analysis to research the impact of Virtual reality on Alzheimer’s Disease",
    "body": ["When learning about the impact that latest technology has on the field of neuroscience, specifically the development and structure of the brian, I conducted thorough research on how virtual reality can be used to delay cognitive decline. The presentation of my findings can be found below."],
    "mainImage": "images/vr.jpg",
    "reportLink": "https://acrobat.adobe.com/link/review?uri=urn:aaid:scds:US:7fbf8000-1caf-3512-9955-b97a589f23a9"
  },
  {
    "id": 11,
    "type": "Other",
    "title": "Magnetic stimulation for Guillain-Barré Syndrome",
    "description": "Studied the use cases of transcranial and peripheral magnetic stimulation to treat Guillain-Barré syndrome symptoms",
    "body": ["Based on past research publications on the benefits of using transcranial and peripheral magnetic stimulation to improve motor control, created a NIH standard research proposal with research questions and an outlined experiment, in an effort to better understand these technologies and use them to treat Guillain-Barré Syndrome. "],
    "mainImage": "images/tms.png",
    "reportLink": "https://docs.google.com/presentation/d/1D4OXSL9qcaodoHja8p19ZL0TZrl-vf-ljrXPbQ7fIIY/edit?usp=sharing"
  }
]